DataProcessors/АвтоматическоеУправлениеКомпаниями.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<DataProcessor>		<InternalInfo>			<xr:GeneratedType name="DataProcessorObject.јвтоматическое”правление омпани€ми" category="Object">				<xr:TypeId>1dc1c663-f80f-4b8a-a7ce-caa1c0ebd0e4</xr:TypeId>				<xr:ValueId>8a206cda-9a25-4188-ab46-b0c6767d7cdf</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="DataProcessorManager.јвтоматическое”правление омпани€ми" category="Manager">				<xr:TypeId>dea4c3c4-ddbc-473f-9052-293db5c8366b</xr:TypeId>				<xr:ValueId>95b869c7-d5fa-4255-933e-5324eefcd780</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>јвтоматическое”правление омпани€ми</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>јвтоматическое управление компани€ми</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Update of types of equipment</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Attribute>				<Properties>					<Name>Ётоќбработкаќбменаƒанными</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Ёто обработка обмена данными</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>This is data processor of data exchange</v8:content>						</v8:item>					</Synonym>					<Comment>фиктивный реквизит, наличие которого означает, что данна€ обработка сделана по технологии нетиповых обменов </Comment>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>1</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>				</Properties>			</Attribute>		</ChildObjects>	</DataProcessor></MetaDataObject>

AccumulationRegisters/Кампании.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<AccumulationRegister>		<InternalInfo>			<xr:GeneratedType name="AccumulationRegisterRecord.Кампании" category="Record">				<xr:TypeId>e2734ad6-80b9-4688-aad8-cebe929919b5</xr:TypeId>				<xr:ValueId>779ea25b-6dab-4e91-8439-2900a65d7504</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterManager.Кампании" category="Manager">				<xr:TypeId>e93381f8-5a94-4878-966d-7aef54fe1309</xr:TypeId>				<xr:ValueId>19478f29-2801-41e6-b417-f7f2d4b16e87</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterSelection.Кампании" category="Selection">				<xr:TypeId>47e8e0ff-f276-4b58-a233-5812bbc3c787</xr:TypeId>				<xr:ValueId>105585a5-abcf-490a-8542-d4f96436cd73</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterList.Кампании" category="List">				<xr:TypeId>94126ad6-fbcf-4bdd-8e01-9b1479dbccb9</xr:TypeId>				<xr:ValueId>b1860b9c-438a-4b47-a6c0-e38ebe80e09e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordSet.Кампании" category="RecordSet">				<xr:TypeId>6d647c3f-3f0a-43ff-aad3-26410d9397cd</xr:TypeId>				<xr:ValueId>d70c3e32-eab7-4f65-b2fc-abfad443988c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordKey.Кампании" category="RecordKey">				<xr:TypeId>adce50af-5837-42e3-98c7-82ad421249ac</xr:TypeId>				<xr:ValueId>24966b88-4c58-4087-973e-82312b31e495</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>Кампании</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Кампании</v8:content>				</v8:item>				<v8:item>					<v8:lang>en</v8:lang>					<v8:content>Campaigns</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultListForm/>			<AuxiliaryListForm/>			<RegisterType>Balance</RegisterType>			<IncludeHelpInContents>false</IncludeHelpInContents>			<StandardAttributes>				<xr:StandardAttribute name="RecordType">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSplitting>true</EnableTotalsSplitting>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Количество</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Количество</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Quantity</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:decimal</v8:Type>						<v8:NumberQualifiers>							<v8:Digits>10</v8:Digits>							<v8:FractionDigits>0</v8:FractionDigits>							<v8:AllowedSign>Any</v8:AllowedSign>						</v8:NumberQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Order</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Кампания</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Кампания</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Campaign</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Кампании</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>		</ChildObjects>	</AccumulationRegister></MetaDataObject>

DataProcessors/АвтоматическоеУправлениеКомпаниями/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеОбработкиОбмена() Экспорт
	
	// полный состав параметров описания смотри в этой функции
	СтруктураНастроек = Справочники.НетиповыеОбменыДанными.ПолучитьОписаниеОбработкиОбменаПоУмолчанию();
	
	СтруктураНастроек.ТекстовоеОписаниеОбмена = НСтр("ru='Автоматическая постановка и снятие заказов на кампанию';en='Automatic setting and removal orders on the campaign'");
	СтруктураНастроек.ВидОбмена = Перечисления.ВидыОбмена.Двунаправленный;
	СтруктураНастроек.СпособПередачиДанных = Перечисления.СпособыПередачиДанныхВНетиповыхОбменах.None;
	СтруктураНастроек.XML_НастройкаОбязательна = Ложь;
	СтруктураНастроек.XML_НастройкаОбязательна = Ложь;
	СтруктураНастроек.ИспользованиеРегламентогоЗадания = Истина;
	СтруктураНастроек.ИспользованиеРегистрацииДанныхНаУзлеНетиповогоОбмена = Истина;
	СтруктураНастроек.ВидимыеДополнительныеЭлементыФормы.Добавить("АвтоматическоеУправлениеКампаниями");
	
	Возврат СтруктураНастроек;
КонецФункции 


Функция ВыполнитьОбмен(Событие,НастройкаОбмена) Экспорт
	
	ТекстСообщенийСОшибками = "";
	
	Если не ЗначениеЗаполнено(НастройкаОбмена.УзелРегистрацииИзменений) Тогда
		Сообщение = НСтр("ru='Узел регистрации изменений не заполнен.';en='Node of registration of changes is not filled.'");	
		РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие,Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка,Сообщение);	
		Возврат Сообщение;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = НетиповыеОбмены.ПолучитьТекстЗапроса_ВыгружаемыеДокументыПоУзлуНетиповогоОбмена();	
	Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	НовыеДвиженияПоКонвейеру.ВыгружаемыйОбъект
		|ПОМЕСТИТЬ НевыгруженныеДокументы
		|ИЗ
		|	НовыеДвиженияПоКонвейеру КАК НовыеДвиженияПоКонвейеру
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НевыгруженныеДокументы.ВыгружаемыйОбъект КАК Документ,
		|	ДвижениеЗаказов.ТочкаРегистрации,
		|	ДвижениеЗаказов.Заказ
		|ПОМЕСТИТЬ ИсходнаяСЗаказами
		|ИЗ
		|	НевыгруженныеДокументы КАК НевыгруженныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеЗаказов КАК ДвижениеЗаказов
		|		ПО НевыгруженныеДокументы.ВыгружаемыйОбъект = ДвижениеЗаказов.Регистратор
		|			И (ДвижениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяСЗаказами.Документ КАК Документ,
		|	ИсходнаяСЗаказами.Заказ,
		|	АвтоматическоеУправлениеКампаниями.Кампания,
		|	АвтоматическоеУправлениеКампаниями.Установить,
		|	АвтоматическоеУправлениеКампаниями.Снять,
		|	АвтоматическоеУправлениеКампаниями.ФормулаОпределенияВозможностиВУправленииКампанией,
		|	ВЫБОР
		|		КОГДА АвтоматическоеУправлениеКампаниями.Кампания ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕслиПодходящаяАвтоматическаяКомпания
		|ИЗ
		|	ИсходнаяСЗаказами КАК ИсходнаяСЗаказами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвтоматическоеУправлениеКампаниями КАК АвтоматическоеУправлениеКампаниями
		|		ПО ИсходнаяСЗаказами.ТочкаРегистрации = АвтоматическоеУправлениеКампаниями.ТочкаРегистрации
		|ИТОГИ ПО
		|	Документ";
	Запрос.УстановитьПараметр("Узел",НастройкаОбмена.УзелРегистрацииИзменений);	
	РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Справочники.СОЛЛЕРС_КлассификаторСобытий.ГлобальнаяОшибкаИнформационнойБазы,Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка,Запрос.Текст);
	РезультатЗапроса = Запрос.Выполнить();
	
	флЕстьДанныеДляПередачи = Не РезультатЗапроса.Пустой();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Статистика = "";
	Пока ВыборкаДокумент.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДокумент

		ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
        НачатьТранзакцию();
		флЕстьОшибкиПоЗаказамВнутриДокумента = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЕслиПодходящаяАвтоматическаяКомпания = ложь Тогда
				продолжить;
			КонецЕсли; 
			
			ЗаказУжеВключенВКампанию = ЗаказВключенВКампанию(ВыборкаДетальныеЗаписи.Заказ,ВыборкаДетальныеЗаписи.Кампания);
			
			Если ВыборкаДетальныеЗаписи.Установить и ЗаказУжеВключенВКампанию или ВыборкаДетальныеЗаписи.Снять и ЗаказУжеВключенВКампанию=Ложь Тогда
				Продолжить;
			КонецЕсли; 
			
			ОписаниеОшибки = "";
			ЗаказПодходит = Истина;
			Если Не ПустаяСтрока(ВыборкаДетальныеЗаписи.ФормулаОпределенияВозможностиВУправленииКампанией) Тогда
				ЗаказПодходит = ВычислитьФормулу(ВыборкаДетальныеЗаписи.ФормулаОпределенияВозможностиВУправленииКампанией,ВыборкаДетальныеЗаписи.Заказ,ОписаниеОшибки);
				Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
					ТекстСообщенийСОшибками = ТекстСообщенийСОшибками + ?(ТекстСообщенийСОшибками = "","", Символы.ПС) + НСтр("ru='Заказ ""';en='The order ""'") + """:" + Символы.ПС;
					ТекстСообщенийСОшибками = ТекстСообщенийСОшибками + ОписаниеОшибки + Символы.ПС;
					флЕстьОшибкиПоЗаказамВнутриДокумента = Истина;
					ЗаказПодходит = Ложь;
				КонецЕсли;
			КонецЕсли; 
			Если ЗаказПодходит Тогда
				ДокКампация = Документы.ОперацияПоКампании.СоздатьДокумент();
				ДокКампация.Дата = ТекущаяДата();
				ДокКампация.Заказ = ВыборкаДетальныеЗаписи.Заказ;
				ДокКампация.Кампания = ВыборкаДетальныеЗаписи.Кампания;
				ДокКампация.ОперацияКампании = ?(ВыборкаДетальныеЗаписи.Установить,Перечисления.ОперацииКампании.Установка,Перечисления.ОперацииКампании.Снятие);
				ДокКампация.Записать(РежимЗаписиДокумента.Проведение);
				Статистика = Статистика + ?(ПустаяСтрока(Статистика),"",Символы.ПС)+ВыборкаДетальныеЗаписи.Кампания+?(ВыборкаДетальныеЗаписи.Установить," ""+"" "," ""-"" ");
			КонецЕсли; 
		КонецЦикла;
		Если флЕстьОшибкиПоЗаказамВнутриДокумента Тогда
			ОтменитьТранзакцию();
		Иначе
			ОписаниеОшибки = "";
			ДокументМассивом = новый Массив;
			ДокументМассивом.Добавить(ВыборкаДокумент.Документ);
			
			Если не НетиповыеОбмены.ЗарегистрироватьВыгрузкуОбъектовИзПланаОбмена(НастройкаОбмена.Ссылка,ДокументМассивом,,ОписаниеОшибки,"","") Тогда	
				ОтменитьТранзакцию(); 
				Сообщение = НСтр("ru='Неудачная попытка регистрации выгруженных объектов:';en='Unsuccessful attempt of registration of uploaded objects:'")+ОписаниеОшибки;
				ТекстСообщенийСОшибками = ТекстСообщенийСОшибками + ?(ТекстСообщенийСОшибками = "","", Символы.ПС)+Сообщение;	
				Продолжить;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		КонецЕсли; 
	КонецЦикла;
	
	
	Если флЕстьДанныеДляПередачи = Ложь Тогда
		УровеньСообщения = Перечисления.СОЛЛЕРС_УровниСобытия.Информация;
		ТекстСообщения = НСтр("ru='Данных для анализа не обнаружено';en='Data for analysis not detected'")+Символы.ПС+ОписаниеОшибки() ;
		
	ИначеЕсли Не ПустаяСтрока(ТекстСообщенийСОшибками) Тогда
		УровеньСообщения = Перечисления.СОЛЛЕРС_УровниСобытия.Ошибка;
		ТекстСообщения = ТекстСообщенийСОшибками + ?(ПустаяСтрока(Статистика),"",Символы.ПС+НСтр("ru='Выполнены следующие изменения: ';en='The following changes have been made:'")+Символы.ПС+Статистика);
	Иначе
		УровеньСообщения = Перечисления.СОЛЛЕРС_УровниСобытия.Информация;
		ТекстСообщения = НСтр("ru='Выполнены следующие изменения: ';en='The following changes have been made:'")+Символы.ПС+Статистика;
	КонецЕсли; 
	РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.ЗафиксироватьИнформационноеСообщение(Событие,УровеньСообщения,ТекстСообщения);
	Возврат ТекстСообщения;
	
КонецФункции


Функция ЗаказВключенВКампанию(Заказ,Кампания)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КампанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Кампании.Остатки(
		|			,
		|			Заказ = &Заказ
		|				И Кампания = &Кампания) КАК КампанииОстатки
		|ГДЕ
		|	КампанииОстатки.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Кампания", Кампания);

	Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 

КонецФункции

Функция ВычислитьФормулу(Выражение,Заказ,ТекстСообщения)
	перем Результат;
	
	
	Результат = "";
	Попытка
		выполнить("Результат = "+Выражение);
	Исключение
		ТекстСообщения = НСтр("ru='Произошла ошибка вычисления выражения ""';en='Error of calculation of the expression '")+Выражение+НСтр("ru='"" - ""';en='"" occurred - ""'")+ОписаниеОшибки()+""","+символы.ПС;
		Возврат "";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ВычислитФормулу
